## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-02-11T14:24:05.179+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "nXug4qmbzW5W5dFhoG/Z9EUC6yAM2m7zjZ3dZk0hK0o=" -> "qOllZDkIqy9K5Mbe21/6Fjfp+ktwY42Jcfv6482aDIM=" # forces replacement
      ~ source_code_size            = 10311342 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version_permission.lambda_layer_permission must be replaced
-/+ resource "aws_lambda_layer_version_permission" "lambda_layer_permission" {
      ~ id             = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer,6" -> (known after apply)
      ~ layer_name     = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply) # forces replacement
      ~ policy         = jsonencode(
            {
              - Id        = "default"
              - Statement = [
                  - {
                      - Action    = "lambda:GetLayerVersion"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:6"
                      - Sid       = "shared-layer-permission"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ revision_id    = "aa242904-64df-4b5c-8c1e-7bf283f5c588" -> (known after apply)
      ~ version_number = 6 -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
